config/jmeter_test/five_products_test_plan.jmx
<?xml version="1.0" encoding="UTF-8"?>
<jmeterTestPlan version="1.2" properties="5.0">
  <hashTree>
    <TestPlan guiclass="TestPlanGui" testclass="TestPlan" testname="Five Products Test Plan">
      <elementProp name="TestPlan.user_defined_variables" elementType="Arguments">
        <collectionProp name="Arguments.arguments"/>
      </elementProp>
    </TestPlan>
    <hashTree>
      <ThreadGroup guiclass="ThreadGroupGui" testclass="ThreadGroup" testname="Product Access Group">
        <elementProp name="ThreadGroup.main_controller" elementType="LoopController">
          <boolProp name="LoopController.continue_forever">true</boolProp>
          <intProp name="LoopController.loops">100</intProp>
        </elementProp>
        <stringProp name="ThreadGroup.num_threads">100</stringProp>
        <stringProp name="ThreadGroup.ramp_time">10</stringProp>
      </ThreadGroup>
      <hashTree>
        <!-- Product 1 - 50% -->
        <ThroughputController guiclass="ThroughputControllerGui" testclass="ThroughputController" testname="Product1 Controller - 50%">
          <intProp name="ThroughputController.style">1</intProp>
          <boolProp name="ThroughputController.perThread">false</boolProp>
          <intProp name="ThroughputController.maxThroughput">50</intProp>
          <FloatProperty>
            <name>ThroughputController.percentThroughput</name>
            <value>50.0</value>
          </FloatProperty>
          <stringProp name="TestPlan.comments">Handles 50% of traffic</stringProp>
        </ThroughputController>
        <hashTree>
          <HTTPSamplerProxy guiclass="HttpTestSampleGui" testclass="HTTPSamplerProxy" testname="Product1 Request">
            <stringProp name="HTTPSampler.path">/product1</stringProp>
            <stringProp name="HTTPSampler.method">GET</stringProp>
            <stringProp name="HTTPSampler.domain">localhost</stringProp>
            <stringProp name="HTTPSampler.port">80</stringProp>
          </HTTPSamplerProxy>
        </hashTree>

        <!-- Product 2 - 25% -->
        <ThroughputController guiclass="ThroughputControllerGui" testclass="ThroughputController" testname="Product2 Controller - 25%">
          <intProp name="ThroughputController.style">1</intProp>
          <boolProp name="ThroughputController.perThread">false</boolProp>
          <intProp name="ThroughputController.maxThroughput">25</intProp>
          <FloatProperty>
            <name>ThroughputController.percentThroughput</name>
            <value>25.0</value>
          </FloatProperty>
        </ThroughputController>
        <hashTree>
          <HTTPSamplerProxy guiclass="HttpTestSampleGui" testclass="HTTPSamplerProxy" testname="Product2 Request">
            <stringProp name="HTTPSampler.path">/product2</stringProp>
            <stringProp name="HTTPSampler.method">GET</stringProp>
            <stringProp name="HTTPSampler.domain">localhost</stringProp>
            <stringProp name="HTTPSampler.port">80</stringProp>
          </HTTPSamplerProxy>
        </hashTree>

        <!-- Product 3 - 15% -->
        <ThroughputController guiclass="ThroughputControllerGui" testclass="ThroughputController" testname="Product3 Controller - 15%">
          <intProp name="ThroughputController.style">1</intProp>
          <boolProp name="ThroughputController.perThread">false</boolProp>
          <intProp name="ThroughputController.maxThroughput">15</intProp>
          <FloatProperty>
            <name>ThroughputController.percentThroughput</name>
            <value>15.0</value>
          </FloatProperty>
        </ThroughputController>
        <hashTree>
          <HTTPSamplerProxy guiclass="HttpTestSampleGui" testclass="HTTPSamplerProxy" testname="Product3 Request">
            <stringProp name="HTTPSampler.path">/product3</stringProp>
            <stringProp name="HTTPSampler.method">GET</stringProp>
            <stringProp name="HTTPSampler.domain">localhost</stringProp>
            <stringProp name="HTTPSampler.port">80</stringProp>
          </HTTPSamplerProxy>
        </hashTree>

        <!-- Product 4 - 8% -->
        <ThroughputController guiclass="ThroughputControllerGui" testclass="ThroughputController" testname="Product4 Controller - 8%">
          <intProp name="ThroughputController.style">1</intProp>
          <boolProp name="ThroughputController.perThread">false</boolProp>
          <intProp name="ThroughputController.maxThroughput">8</intProp>
          <FloatProperty>
            <name>ThroughputController.percentThroughput</name>
            <value>8.0</value>
          </FloatProperty>
        </ThroughputController>
        <hashTree>
          <HTTPSamplerProxy guiclass="HttpTestSampleGui" testclass="HTTPSamplerProxy" testname="Product4 Request">
            <stringProp name="HTTPSampler.path">/product4</stringProp>
            <stringProp name="HTTPSampler.method">GET</stringProp>
            <stringProp name="HTTPSampler.domain">localhost</stringProp>
            <stringProp name="HTTPSampler.port">80</stringProp>
          </HTTPSamplerProxy>
        </hashTree>

        <!-- Product 5 - 2% -->
        <ThroughputController guiclass="ThroughputControllerGui" testclass="ThroughputController" testname="Product5 Controller - 2%">
          <intProp name="ThroughputController.style">1</intProp>
          <boolProp name="ThroughputController.perThread">false</boolProp>
          <intProp name="ThroughputController.maxThroughput">2</intProp>
          <FloatProperty>
            <name>ThroughputController.percentThroughput</name>
            <value>2.0</value>
          </FloatProperty>
        </ThroughputController>
        <hashTree>
          <HTTPSamplerProxy guiclass="HttpTestSampleGui" testclass="HTTPSamplerProxy" testname="Product5 Request">
            <stringProp name="HTTPSampler.path">/product5</stringProp>
            <stringProp name="HTTPSampler.method">GET</stringProp>
            <stringProp name="HTTPSampler.domain">localhost</stringProp>
            <stringProp name="HTTPSampler.port">80</stringProp>
          </HTTPSamplerProxy>
        </hashTree>
      </hashTree>
    </hashTree>
  </hashTree>
</jmeterTestPlan>